package lesson6;

public class HomeWork_4 {
    public static void main(String[] args) throws Exception {
        //Базовый уровень
        //Задача №1
        //1. Создать два класса, которые умеют летать: самолет и утка. Атрибут утки: isInjured (ранен),
        // атрибут самолета: countPassengers.
        //2. Создать интерфейс, который объединяет эти два класса.
        //3. Имплементировать его в двух классах
        //4. Реализовать метод летать:
        // Для утки:
        // Метод летать будет выкидывать ошибку FlyException (создать такой класс), если утка подстрелена,
        // иначе печатать на экран "утка летит"
        // Для самолета:
        // Метод летать будет выкидывать ошибку FlyException, если количество пассажиров меньше нуля.
        // Иначе печать "самолет летит"
        //5. Создать 1 утку не раненую, 1 утку раненую, 1 самолет с 10 пассажирами, 1 самолет с -1 пассажиром.
        //6. Вызвать у них метод летать
        // Перехватить исключения: вывести на экран message ошибки
        // Ожидание:
        // утка летит
        // Ошибка: утка ранена
        // самолет летит
        // Ошибка: пассажиров в самолете меньше 0
        Plain plain1 = new Plain(10);
        Plain plain2 = new Plain(-1);
        Duck duck1 = new Duck(false);
        Duck duck2 = new Duck(true);

        Flying[] flyings = {plain1, plain2, duck1, duck2};
        for (Flying flying : flyings) {
            try {
                flying.fly();
            }catch (FlyException e){
                System.out.println(e.getMessage());
            }
        }

        //Продвинутый уровень
        //Задача №1
        //1. Создать следующую структуру из классов и интерфейсов:
        // дерево -> ель (имеет шишки, умеет пахнуть)
        // дерево -> сосна (имеет шишки, умеет пахнуть)
        // растение -> роза (умеет цвести, умеет пахнуть)
        // растение -> папоротник (умеет цвести)
        // Создать у каждого класса по объекту, распределить по массивам интерфейсов
        // И у каждого массива вызвать характерный метод
        //Ожидание:
        // сосна : умеет пахнуть
        // ель : умееть пахнуть
        // роза: умееть пахнуть
        // роза: умеет цвести
        // папоротник: умеет цвести
        Tree pine = new Pine();
        Tree spruce = new Spruce();
        Plant rose = new Rose();
        Plant fern = new Fern();
        Smellable[] smellables = {pine, spruce,rose, fern};
        for (Smellable smellable : smellables) {
            smellable.smell();
            if(smellable instanceof Plant){
                Plant myFern = (Plant) smellable;
                myFern.bloom();
            }
        }
    }
}
